In [36]:
import pandas as pd

data = {'Nama': ['John', 'Jane', 'Bob', 'Alice'],
        'Usia': [25, 35, 30, 28],
        'Gaji': [50000, 60000, 70000, 55000]}

df = pd.DataFrame(data)
print(df)

    Nama  Usia   Gaji
0   John    25  50000
1   Jane    35  60000
2    Bob    30  70000
3  Alice    28  55000

In [37]:
# Gunakan loop for dan fungsi lambda untuk menghitung gaji setiap karyawan setelah diberikan peningkatan sebesar 5% dari gaji saat ini.
# Setelah perubahan dilakukan, tampilkan DataFrame yang sudah diperbarui dan berikan ringkasan perubahan yang telah terjadi.
for i in data:
    df['Naik 5 Persen'] = df['Gaji'].apply(lambda x: x * 0.05)

df['Total Gaji'] = df['Naik 5 Persen'] + df['Gaji']

df

    Nama  Usia   Gaji  Naik 5 Persen  Total Gaji
0   John    25  50000         2500.0     52500.0
1   Jane    35  60000         3000.0     63000.0
2    Bob    30  70000         3500.0     73500.0
3  Alice    28  55000         2750.0     57750.0

In [38]:
# Gunakan loop for lagi untuk mengevaluasi karyawan yang usianya di atas 30 tahun. Jika usia karyawan di atas 30, berikan peningkatan tambahan sebesar 2% dari gaji saat ini menggunakan fungsi lambda.
# Tampilkan DataFrame yang sudah diperbarui setelah peningkatan gaji tambahan dan berikan ringkasan hasilnya.
for i in data:
    df['Bonus_2%'] = df.apply(lambda tua: tua['Total Gaji'] * 0.02 if tua['Usia'] > 30 else 0, axis= 1)

df['Total Gaji'] = df['Total Gaji'] + df['Bonus_2%']

df

    Nama  Usia   Gaji  Naik 5 Persen  Total Gaji  Bonus_2%
0   John    25  50000         2500.0     52500.0       0.0
1   Jane    35  60000         3000.0     64260.0    1260.0
2    Bob    30  70000         3500.0     73500.0       0.0
3  Alice    28  55000         2750.0     57750.0       0.0